Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_and_work/index.html.txt.tmx
Source language: en
Languages: ga

source: Social welfare payments and work
ga: Íocaíochtaí Leasa Shóisialaigh agus Obair

source: Back to Work Enterprise Allowance
ga: Liúntas Fiontraíochta um Fhilleadh ar Obair

source: If you are getting certain social welfare payments, there are supports to help you become self-employed
ga: In Éirinn, spreagtar daoine atá ag fáil íocaíochtaí áirithe leasa shóisialta chun dul i mbun féinfhostaíochta

source: Find out about the Back to Work Enterprise Allowance scheme
ga: Faigh eolas faoin scéim Liúntas Fiontraíochta um Fhilleadh ar Obair

source: Disability payments and work
ga: Na híocaíochtaí míchumais agus obair

source: Information on how rehabilitative work or training can affect your disability payment and any extra benefits you are getting
ga: Faisnéis faoi conas a fhéadann obair athshlánúcháin nó oiliúint athshlánúcháin dul i bhfeidhm ar d’íocaíocht míchumais agus ar aon sochair bhreise atá á bhfáil agat

source: Jobseeker's Allowance and work
ga: Liúntas Cuardaitheora Poist agus obair

source: Explains how your income from work and your spouse's income from work can affect your rate of Jobseeker's Allowance
ga: Déanann sé cur síos ar an mbealach is féidir le d'ioncam ó obair agus ioncam ó obair do chéile tionchar a bheith acu ar do ráta Liúntais Cuardaitheora Poist

source: This document is in: Social Welfare > Irish social welfare system > Means test for social welfare payments
ga: This document is in: Leas Sóisialach > Córas Leasa Shóisialaigh na hÉireann > Tástáil Acmhainne le haghaidh Íocaíochtaí Leasa Shóisialaigh

source: Jobseeker's Benefit and work
ga: Obair agus Sochar Cuardaitheora Poist

source: You may be able to work and get Jobseeker's Benefit
ga: Tá cúinsí ann inar féidir leat a bheith ag obair agus Sochar Cuardaitheora Poist a fháil

source: This document explains how work affects your Jobseeker's Benefit
ga: Déanann sé cur síos ar an mbealach is féidir le d'ioncam ó obair agus ioncam fostaíochta do chéile/pháirtí tionchar a bheith acu ar do ráta Sochair Cuardaitheora Poist

source: Help with low pay
ga: Cúnamh do dhaoine ar phá iseal

source: Tax and social welfare assistance is available for low income earners and their families
ga: Tá faoiseamh cánach agus cúnamh leasa shóisialaigh le fáil in Éirinn ag daoine ar ioncam íseal agus ag a gclann

source: Information on available schemes and how to apply
ga: Eolas faoi na scéimeanna féin agus faoin gcaoi le cur isteach orthu

source: If your business has closed or if you are self-employed but have less work and less income than before you may qualify for a social welfare payment
ga: An bhfuil tú féinfhostaithe agus is lú obair agus ioncam agat? Faigh amach dá bhfaighfeá íocaíocht leasa shóisialaigh

source: This document is in: Social Welfare > Social welfare payments > Unemployed people
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Daoine Dífhostaithe

source: Voluntary work and social welfare payments
ga: Obair dheonach agus íocaíochtaí leasa shóisialaigh

source: If you want to keep your social welfare payment and do some voluntary work, you must follow the rules set down by the Department of Social Protection
ga: Dá mba mhian leat d’íocaíocht leasa shóisialaigh a choinneáil agus roinnt obair dheonach a dhéanamh, ní mór duit cloí leis na rialacha atá leagtha síos ag an Roinn Coimirce Sóisialaí. Faigh tuilleadh eolais

source: This document is in: Social Welfare > Social welfare payments
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh

source: After-School Child Care Scheme
ga: An Scéim Cúram Leanaí Iarscoile

source: If you have been unemployed and you get a new job, increase the number of hours that you work or take up a place on an employment support scheme you may be eligible for a subsidised afterschool childcare place for primary school children
ga: Más rud é go raibh tú dífhostaithe agus go bhfaigheann tú post nua, nó go méadaíonn tú líon na laethanta a oibríonn tú nó go dtéann tú i mbun scéim tacaíocht fostaíochta, is féidir go mbeidh tú incháilithe d’áit fhóirdheonaithe i gcúram leanaí do leanaí bunscoile

source: Back to Work Allowance
ga: An Scéim Dhreasachta Poist Pháirtaimseartha

source: The Back to Work Allowance Scheme provides support to certain unemployed people (and others) when they return to work. The scheme provides a continued partial payment of social welfare entitlements and 'secondary benefits'. From 1 May 2009, the scheme is closed to new applicants
ga: Tugann an Scéim Dhreasachta Poist Pháirtaimseartha (SDPP) deis do dhaoine áirithe atá dífhostaithe go fadtéarmach glacadh le hobair pháirtaimseartha agus liúntas speisialta seachtainiúil a fháil in áit na híocaíochta cuardaitheora poist

source: The Part-Time Job Incentive (PTJI) Scheme allows certain long-term unemployed people to take up part-time work and get a special weekly allowance instead of their jobseeker’s payment
ga: Soláthraíonn an scéim seo íocaíocht sheachtainiúil do dhaoine áirithe atá tar éis a bpost a chailleadh agus atá ag iarraidh a ngnó féin a thosú

source: This scheme provides a weekly payment to certain people who have lost their job and want to start their own business
ga: Soláthraíonn an Scéim Liúntas um Fhilleadh ar Obair tacaíocht do dhaoine dífhostaithe áirithe (agus daoine eile) nuair a théann siad ar ais ar obair

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil
